---
kind: property
id: P:Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintPearlColor
source: html/564515cf-30cf-fa9a-7d91-9aba9dd36228.htm
---
# Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintPearlColor Property

The property labeled "Color" from the "MetallicPaint" schema.

## Syntax (C#)
```csharp
public static string MetallicpaintPearlColor { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.